In [1]:
import pandas as pd

In [2]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
list('321')

['3', '2', '1']

In [4]:
df = pd.DataFrame(data,list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [5]:
df.sort_index(inplace = True)
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [6]:
df.sort_index(inplace = True, axis = 1)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [7]:
df.sort_values(by = 'X', inplace = True)

In [8]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

## outra forma de fazer o sorte passando um list

In [10]:
df.sort_values(by = ['X','Y'], inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [9]:
df.sort_values(by = '3', axis= 1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [19]:
linha = [
    ['Ary', 'M',  21],
    ['Nome', 'F', 19],
    ['Carlos', 'M', 50],
    ['Beto', 'M', 29],
    ['Bruna', 'F', 31],
    ['Ana', 'F', 42]
]
linha

[['Ary', 'M', 21],
 ['Nome', 'F', 19],
 ['Carlos', 'M', 50],
 ['Beto', 'M', 29],
 ['Bruna', 'F', 31],
 ['Ana', 'F', 42]]

In [34]:
coluna = ['Nome', 'Sexo', 'Idade']
coluna

['Nome', 'Sexo', 'Idade']

In [35]:
df_A = pd.DataFrame(data = linha, columns = coluna)
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1    Nome    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50